function [Hd,H] = My_Per_trans(x,y,X,Y)
%UNTITLED 此处显示有关此函数的摘要
%   此处显示详细说明
A = [X(1),Y(1),1,0,0,0,-x(1)*X(1),-x(1)*Y(1);
    0,0,0,X(1),Y(1),1,-y(1)*X(1),-y(1)*Y(1);
    X(2),Y(2),1,0,0,0,-x(2)*X(2),-x(2)*Y(2);
    0,0,0,X(2),Y(2),1,-y(2)*X(2),-y(2)*Y(2);
    X(3),Y(3),1,0,0,0,-x(3)*X(3),-x(3)*Y(3);
    0,0,0,X(3),Y(3),1,-y(3)*X(3),-y(3)*Y(3);
    X(4),Y(4),1,0,0,0,-x(4)*X(4),-x(4)*Y(4);
    0,0,0,X(4),Y(4),1,-y(4)*X(4),-y(4)*Y(4)];
B = [x(1);y(1);x(2);y(2);x(3);y(3);x(4);y(4)];

H=A\B;  % 求解H11到H18
H=H';  % 把列向量改成行向量
H=[H,1];  % 获得完整的H的行向量

H11 =H(1);H12 =H(2); H13 =H(3); H21 =H(4); H22 =H(5); H23 =H(6); H31 =H(7); H32 =H(8); H33=H(9);
H=[H11,H12,H13;H21,H22,H23;H31,H32,H33];  % 获得完整的H的矩阵
Hd=inv(H);  % 获得Hd矩阵
end

